alibaba/AliOS-Things/platform/mcu/stm32f0xx/hal/hal_uart_stm32f0.c
    aos_mutex_new(&stm32_uart[uart->port].uart_tx_mutex);
    aos_mutex_new(&stm32_uart[uart->port].uart_rx_mutex);
    aos_sem_new(&stm32_uart[uart->port].uart_rx_sem, 0);
    aos_sem_new(&stm32_uart[uart->port].uart_tx_sem, 0);

    /* if UART Rx DMA Handle is NULL, then start data receive in interrupt mode
     * otherwise in DMA mode
     */
    if(pstuarthandle->hdmarx == NULL) {
        ret = uart_receive_start_it(uart->port,uartIns->attr.max_buf_bytes);
    }
    else {
        //init uart dma receive
        ret = uart_receive_start_dma(uart->port,uartIns->attr.max_buf_bytes);
    }

    if (ret) {
        aos_free(stm32_uart[uart->port].UartRxBuf);
        stm32_uart[uart->port].UartRxBuf = NULL;
        aos_mutex_free(&stm32_uart[uart->port].uart_tx_mutex);
        aos_mutex_free(&stm32_uart[uart->port].uart_rx_mutex);
        aos_sem_free(&stm32_uart[uart->port].uart_rx_sem);
        aos_sem_free(&stm32_uart[uart->port].uart_tx_sem);
    }
    return ret;
}

static int32_t uart_receive_start_it(PORT_UART_TYPE uart_port, uint32_t max_buffer_size)
{
    UART_HandleTypeDef *pstuarthandle = NULL;

    pstuarthandle = &stm32_uart[uart_port].hal_uart_handle;
    //HAL_UART_RxCpltCallback is called per 1 byte, to update uart_rx_in
    if(HAL_UART_Receive_IT(pstuarthandle,(uint8_t*)&stm32_uart[uart_port].UartRxBuf[0],1)!= HAL_OK)
    {
        return -1;
    }
    stm32_uart[uart_port].inited = 1;

    return 0;
}

static int32_t uart_receive_start_dma(PORT_UART_TYPE uart_port, uint32_t max_buffer_size)
{
    UART_HandleTypeDef *pstuarthandle = NULL;
    uint32_t temp_reg;

    pstuarthandle = &stm32_uart[uart_port].hal_uart_handle;

    //enable IDLE interrupt
    __HAL_UART_ENABLE_IT(pstuarthandle, UART_IT_IDLE);
    //clear the IDLE interrupt flag first
    __HAL_UART_CLEAR_IDLEFLAG(pstuarthandle);

    if(HAL_UART_Receive_DMA(pstuarthandle,(uint8_t*)&stm32_uart[uart_port].UartRxBuf[0], max_buffer_size/2) != HAL_OK)
    {
        return -1;
    }

    stm32_uart[uart_port].inited = 1;
    stm32_uart[uart_port].previous_dma_leftbyte = max_buffer_size/2;

    return 0;
}

int32_t hal_uart_send(uart_dev_t *uart, const void *data, uint32_t size, uint32_t timeout)
{
    int32_t ret = -1;
    UART_HandleTypeDef *handle = NULL;
    UART_MAPPING* uartIns = NULL;

    if ((uart == NULL) || (data == NULL)) {
        return -1;
    }

    uartIns = GetUARTMapping(uart->port);
    if( NULL== uartIns ) {
        return -1;
    }

    handle = uart_get_handle(uart->port);
    if (handle == NULL) {
        return -1;
    }
    if(stm32_uart[uart->port].inited!=1)
    {
        return -1;
    }

    /* if  UART Tx DMA Handle is NULL, then start data send in interrupt mode
     * otherwise in DMA mode
     */
    if(handle->hdmatx ==NULL) {
        ret = uart_send_it(uart->port,data, size, timeout);
    }
    else {
        ret = uart_send_dma(uart->port,data, size, timeout);
    }

    return ret;
}

static int32_t uart_send_it(PORT_UART_TYPE uart_port, const void *data, uint32_t size, uint32_t timeout)
{
    HAL_StatusTypeDef sendRlt = HAL_BUSY;

    aos_mutex_lock(&stm32_uart[uart_port].uart_tx_mutex, AOS_WAIT_FOREVER);
    sendRlt = HAL_UART_Transmit_IT(&(stm32_uart[uart_port].hal_uart_handle), (uint8_t *)data, size);
    aos_sem_wait(&stm32_uart[uart_port].uart_tx_sem, timeout);
    aos_mutex_unlock(&stm32_uart[uart_port].uart_tx_mutex);

    return (sendRlt==HAL_OK)?0:-1;
}

static int32_t uart_send_dma(PORT_UART_TYPE uart_port, const void *data, uint32_t size, uint32_t timeout)
{
    HAL_StatusTypeDef sendRlt = HAL_BUSY;

    aos_mutex_lock(&stm32_uart[uart_port].uart_tx_mutex, AOS_WAIT_FOREVER);

    sendRlt = HAL_UART_Transmit_DMA(&(stm32_uart[uart_port].hal_uart_handle), (uint8_t *)data, size);
    //If failed to start Uart DMA transmit
    if (sendRlt == HAL_OK)
    {
        /*wait for the end of transfer*/
        aos_sem_wait(&stm32_uart[uart_port].uart_tx_sem, timeout);
    }
    aos_mutex_unlock(&stm32_uart[uart_port].uart_tx_mutex);
    return (sendRlt==HAL_OK)?0:-1;
}

int32_t hal_uart_recv_II(uart_dev_t *uart, void *data, uint32_t expect_size,
                      uint32_t *recv_size, uint32_t timeout)
{
    int32_t ret = -1;
    UART_MAPPING* uartIns = NULL;

    if ((uart == NULL) || (data == NULL)) {
        return -1;
    }

    uartIns = GetUARTMapping(uart->port);
    if(NULL== uartIns) {
        return -1;
    }

    if (aos_mutex_lock(&stm32_uart[uart->port].uart_rx_mutex, timeout)) {
        printf("uart port % recv fail to get mutex \r\n", uart->port);
        return -1;
    }

    if(stm32_uart[uart->port].hal_uart_handle.hdmarx == NULL) {
        ret = uart_receive_it(uart, data, expect_size, recv_size, timeout);
    }
    else {
        ret = uart_receive_dma(uart, data, expect_size, recv_size, timeout);
    }

    aos_mutex_unlock(&stm32_uart[uart->port].uart_rx_mutex);
    return ret;
}

static int32_t uart_receive_it(uart_dev_t *uart, void *data, uint32_t expect_size,
                      uint32_t *recv_size, uint32_t timeout)
{
    uint8_t *pdata = (uint8_t *)data;
    uint32_t rx_count = 0;
    int32_t ret = -1;

    UART_MAPPING* uartIns = GetUARTMapping(uart->port);

    while (rx_count < expect_size)
    {
        while(stm32_uart[uart->port].uart_rx_out != stm32_uart[uart->port].uart_rx_in)
        {
            pdata[rx_count++] = stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_out++];
            if(stm32_uart[uart->port].uart_rx_out == uartIns->attr.max_buf_bytes)
            {
                stm32_uart[uart->port].uart_rx_out = 0;
            }
            if(rx_count==expect_size)
            {
                break;
            }
        }

        if(rx_count==expect_size)
        {
            break;
        }

        if(RHINO_SUCCESS==aos_sem_wait(&stm32_uart[uart->port].uart_rx_sem, timeout))
        {
            while(stm32_uart[uart->port].uart_rx_out != stm32_uart[uart->port].uart_rx_in)
            {
                pdata[rx_count++] = stm32_uart[uart->port].UartRxBuf[stm32_uart[uart->port].uart_rx_out++];
                if(stm32_uart[uart->port].uart_rx_out == uartIns->attr.max_buf_bytes)
                {
                    stm32_uart[uart->port].uart_rx_out = 0;
                }

                if(rx_count == expect_size)
                {
                    break;
                }
            }
        }
        else
        {
            break;
        }
    }

    if (recv_size != NULL)
    {
        *recv_size = rx_count;
    }

    if(rx_count != 0)
    {
        ret = 0;
    }
    else
    {
        ret = -1;
    }

    return ret;
}

static int32_t uart_receive_dma(uart_dev_t *uart, void *data, uint32_t expect_size,
                      uint32_t *recv_size, uint32_t timeout)
{
    uint8_t *pdata = (uint8_t *)data;
    uint32_t rx_count = 0;
    int32_t ret = -1;
    uint32_t cr1its = 0;
    uint32_t dmaisr = 0;

