alibaba/AliOS-Things/platform/mcu/stm32f0xx/hal/hal_uart_stm32f0.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(huart->Instance);
    UART_MAPPING* uartIns = GetUARTMapping(appPort);

    //check if it is called from UART_DMAReceiveCplt
    if(stm32_uart[appPort].hal_uart_handle.hdmarx != NULL)
    {
        UART_DMA_RxCpltCallback(appPort, uartIns->attr.max_buf_bytes);
    }
    else
    {
        UART_IT_RxCpltCallback(appPort, uartIns->attr.max_buf_bytes);
    }
    aos_sem_signal(&stm32_uart[appPort].uart_rx_sem);
}

static void UART_IT_RxCpltCallback(PORT_UART_TYPE appPort, uint32_t max_buffer_size)
{
    //TODO:
    //should take care to avoid UART_RX_IN get accross UART_RX_OUT, which will loss unread data
    //if receive buffer is too small, or application read data out of receive buffer at very low frequence
    //this situation may happen
    if(++stm32_uart[appPort].uart_rx_in >= max_buffer_size)
    {
        stm32_uart[appPort].uart_rx_in = 0;
    }
    HAL_UART_Receive_IT(&stm32_uart[appPort].hal_uart_handle, (uint8_t*)&stm32_uart[appPort].UartRxBuf[stm32_uart[appPort].uart_rx_in], 1);
}

static void UART_DMA_RxCpltCallback(PORT_UART_TYPE appPort, uint32_t max_buffer_size)
{
    UART_HandleTypeDef huart = stm32_uart[appPort].hal_uart_handle;
    //switch DMA Destination to another buffer region
    if(huart.hdmarx->Instance->CMAR == (uint32_t)&stm32_uart[appPort].UartRxBuf[0])
    {
        if(stm32_uart[appPort].uart_rx_out < max_buffer_size/2)
        {
            HAL_UART_Receive_DMA(&huart,(uint8_t*)&stm32_uart[appPort].UartRxBuf[max_buffer_size/2], max_buffer_size/2);
            stm32_uart[appPort].uart_dma_stop = 0;
            stm32_uart[appPort].previous_dma_leftbyte = max_buffer_size/2;
        } else {
            stm32_uart[appPort].uart_dma_stop = 1;
        }

        stm32_uart[appPort].uart_rx_in = (uint16_t)max_buffer_size/2;
        if(stm32_uart[appPort].uart_rx_in == stm32_uart[appPort].uart_rx_out)
            stm32_uart[appPort].rxbuf_is_full = 1;
    } else {
        if(stm32_uart[appPort].uart_rx_out >= max_buffer_size/2)
        {
            HAL_UART_Receive_DMA(&huart,(uint8_t*)&stm32_uart[appPort].UartRxBuf[0],max_buffer_size/2);
            stm32_uart[appPort].uart_dma_stop = 0;
            stm32_uart[appPort].uart_rx_in = 0;
            stm32_uart[appPort].previous_dma_leftbyte = max_buffer_size/2;
        } else {
            stm32_uart[appPort].uart_dma_stop = 1;
            stm32_uart[appPort].uart_rx_in = 0;//in case uart_rx_in = uart_rx_out, should take in account of "rxbuf_is_full" to identify if buffer is full
            if(stm32_uart[appPort].uart_rx_in == stm32_uart[appPort].uart_rx_out)
            {
			   stm32_uart[appPort].rxbuf_is_full = 1;
            }
        }
    }
}

/**
  * @brief  Rx IDLE callbacks.
  * @param  huart pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
void HAL_UART_IdleCallback(UART_HandleTypeDef *huart)
{
    uint32_t left_byte;
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(huart->Instance);
    UART_MAPPING* uartIns = GetUARTMapping(appPort);

    if(stm32_uart[appPort].uart_dma_stop)
    {
        if(stm32_uart[appPort].uart_error_count < 0xffffffff)
        {
            stm32_uart[appPort].uart_error_count++;
        }
    }
    else
    {
        left_byte = __HAL_DMA_GET_COUNTER(huart->hdmarx);
        /* if left_byte=0, means DMA transfer complete interrupt maybe has happened
         * uart_rx_in will be update in DMA TC interrupt
         * don't do it repeatedly
         */
        if(left_byte < stm32_uart[appPort].previous_dma_leftbyte && left_byte != 0)
        {
            stm32_uart[appPort].uart_rx_in += stm32_uart[appPort].previous_dma_leftbyte - left_byte;
            if(stm32_uart[appPort].uart_rx_in == uartIns->attr.max_buf_bytes)
            {
                stm32_uart[appPort].uart_rx_in = 0;
            }

            stm32_uart[appPort].previous_dma_leftbyte = left_byte;

            if(stm32_uart[appPort].uart_rx_in == stm32_uart[appPort].uart_rx_out)
            {
                stm32_uart[appPort].rxbuf_is_full = 1;
            }
        }
    }
    aos_sem_signal(&stm32_uart[appPort].uart_rx_sem);
}

static void UartIdleHandler(const USART_TypeDef* ins)
{
    UART_HandleTypeDef* huart_handle;
    const PORT_UART_TYPE appPort = GetAppPortFromPhyInstanse(ins);
    huart_handle = &(stm32_uart[appPort].hal_uart_handle);

    //clear IDLE idle interrupt flag
    __HAL_UART_CLEAR_IDLEFLAG(huart_handle);
    HAL_UART_IdleCallback(huart_handle);
}
#endif
